{
  "version": "https://jsonfeed.org/version/1",
  "title": "GurpreetSK.com",
  "home_page_url": "//localhost:1313/",
  "feed_url": "//localhost:1313/feed.json",
  "description": "Gurpreet's thoughts, experiences and learnings",
  "favicon": "//localhost:1313//assets/favicon.ico",
  "expired": false,
  "author": {
    "name": "Gurpreet Singh",
    "url": "//localhost:1313/"
  },
  "items": [
    
    

    
    {
      "id": "328daf5aede58b77fe1eb0aa40691296120ea99d",
      "title": "Impending layoffs?",
      "summary": "",
      "content_text": "So, it seems that in coming weeks (as soon as in 2 weeks?) the mobile team at JobGet will be let go.\nI\u0026rsquo;m unsure how good a decision this is given we pride ourselves in being a mobile-first organisation, with the applications being directly used and loved by thousands of job seekers and hundreds of employers. However, my heart does go out for my colleagues who have put it so much effort to run the shop smoothly despite being low on bandwidth. It sucks to be jobless; it sucks more to have false assurance of importance.\nI hope that, if this happens, it fares well for everyone, myself included.\n",
      "content_html": "\u003cp\u003eSo, it seems that in coming weeks (as soon as in 2 weeks?) the mobile team at JobGet will be let go.\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;m unsure how good a decision this is given we pride ourselves in being a mobile-first organisation, with the applications being directly used and loved by thousands of job seekers and hundreds of employers.\nHowever, my heart does go out for my colleagues who have put it so much effort to run the shop smoothly despite being low on bandwidth. It sucks to be jobless; it sucks more to have false assurance of importance.\u003c/p\u003e\n\u003cp\u003eI hope that, if this happens, it fares well for everyone, myself included.\u003c/p\u003e\n",
      "url": "//localhost:1313/posts/impending-layoffs/",
      "date_published": "22026-22-09T251:2222:00-08:00",
      "date_modified": "22026-22-09T251:2222:00-08:00",
      "author": {
        "name": "Gurpreet Singh",
        "url": "//localhost:1313/"
      }
    }
    
  ]
}